FROM python:3.13-slim 
# берем зависимость питона (создает нам среду питон)

WORKDIR /app
# создает рабочую директорию внутри будущего образа, экземпляра (важно, это не папка виндовс, а путь внутри линукс-файловой системы)

COPY . . 
# переносим проект с виндовса в текущий директорий апп

RUN pip install --no-cache-dir -r requirements.txt
# скачиваем зависимости для работы 

CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
# задаем команду по умолчанию для создния контейнера 

# docker build -t goldapple-api .                                           - создание image через билд 1. -t → имя image.       2. . → текущая папка — Docker ищет здесь Dockerfile и файлы проекта.
# docker run --name goldapple-api-container -p 8001:8000 goldapple-api      - создание контейнера  (8001:8000 слева виндовс, справа контейнер)
# docker rm goldapple-api-container                                         - удаление контейнера
# docker run -p 8001:8000 -e DB_HOST=host.docker.internal goldapple-api     - создание контейнера, где -e DB_HOST указывем хост для работы постгреса 
# host.docker.internal                                                      - Возвращает локальный хост виндовса

# Docker Compose                                                            - инструмент, позволяющий декларативно описать несколько связанных Докер-сервисов в одном YAML-файле и управлять ими, как 1 проектом 
# services                                                                  - Ключ конфигурации Docker compose, он означает, как ниже будут описаны сервисы
# api (наш нейминг)                                                         - Cоздат 1 сервер, назвали его API (то есть функционально он должен запустить веб интерфейс фаст_апи)
# build (внутри api)                                                        - Он говорит, для этого service нужно собрать image по текущему директорию, то есть аналог docker build -t goldapple-api .
# ports (внутри api)                                                        - Указывает порты для этого service
# envirenment (внутри api)                                                  - Передает переменные в окружения контейнера 

# db (наш нейминг)                                                          - 2 сервис, для работы с PostgreSQL, а также мы передаем db как объект хоста в DB_HOST 
# image                                                                     - готовое окружение постгреса
# volumes                                                                   - Описывает подклчюение файлов или хранилищ к контейнеру (использовали что бы БД с виндовса перенести на app)
# - ./init.sql:/docker-entrypoint-initdb.d/init.sql:ro                      - 1 дефис это элемент yaml 2 ./init.sql исходный файл в папке проекта 3 : разделитель 4 /docker-entrypoint-initdb.d/init.sql иницилизация (путь по которому контейнер увидит файл) 5 ro запрет на редакт файла 
#  /var/lib/postgresql/data                                                 - директорий, где PostgreSQL хранит БД -> init.sql (Передаем её в формате db_data: )

# volumes: db_data                                                          - Объявили именнованое хранилище, путь директория выше, будет ссылаться на неё (они обе обязательны)

# docker compose up                                                         - compose читает ямал и приводит проект к описанному состояню (работа двух сервисов)
# docker compose up --build                                                 - Обновление image api (То есть сборка образа заново)  
# docker compose down                                                       - удаление контейнеров (не удаляет именнованые хранилища)
